# SQL with Chinook Data set

In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('chinook.db')
cursor = conn.cursor()

## Start running queries

Columns: Track ID, Track Name, Artist Name, Type, Price Quantity<br>
Tables: Track, Media_Type, Invoice_Line, Artist, Album

In [3]:
q = '''
SELECT track.track_id, track.name track_name, artist.name artist_name, med.name track_type, inv.unit_price unit_price, inv.quantity
FROM invoice_line inv
INNER JOIN track ON track.track_id = inv.track_id
INNER JOIN media_type med ON track.media_type_id = med.media_type_id
INNER JOIN album ON album.album_id = track.album_id
INNER JOIN artist ON artist.artist_id = album.artist_id
WHERE inv.invoice_id = 4
;'''

pd.read_sql_query(q, conn)

,track_id,track_name,artist_name,track_type,unit_price,quantity
0,3448,"Lamentations of Jeremiah, First Set \ Incipit ...",The King's Singers,Protected AAC audio file,0.99,1
1,2560,Violent Pornography,System Of A Down,MPEG audio file,0.99,1
2,3336,War Pigs,Cake,Purchased AAC audio file,0.99,1
3,829,Let's Get Rocked,Def Leppard,MPEG audio file,0.99,1
4,1872,Attitude,Metallica,MPEG audio file,0.99,1
5,748,Dealer,Deep Purple,MPEG audio file,0.99,1
6,1778,You're What's Happening (In The World Today),Marvin Gaye,MPEG audio file,0.99,1
7,2514,Spoonman,Soundgarden,MPEG audio file,0.99,1

Columns: Album, Artist, Tracks_Purchased<br>
Tables: Invlice_Line, Track, Album, Artist

In [3]:
q = '''
SELECT sub.al_name album, sub.ar_name artist, SUM(il.quantity) tracks_purchased
FROM invoice_line il
INNER JOIN (SELECT t.track_id, ar.name ar_name, al.title al_name
            FROM track t
            INNER JOIN album al ON al.album_id = t.album_id
            INNER JOIN artist ar ON al.artist_id = ar.artist_id) as sub
            ON sub.track_id = il.track_id
GROUP BY album
ORDER BY tracks_purchased DESC
LIMIT 5
;'''

pd.read_sql_query(q, conn)

                  album            artist  tracks_purchased
0  Are You Experienced?      Jimi Hendrix               187
1              Faceless          Godsmack                96
2             Mezmerize  System Of A Down                93
3              Get Born               JET                90
4             The Doors         The Doors                83

### SQL Concatination

Columns: Employee Name, Employee Title, Supervisor Name, Supervisor Title <br>
Tables: Employee joined with itself

In [4]:
q = '''
SELECT 
e1.first_name || " " || e1.last_name employee_name,
e1.title employee_title,
e2.first_name || " " || e2.last_name supervisor_name,
e2.title supervisor_title
FROM employee e1
LEFT JOIN employee e2 
ON e1.reports_to = e2.employee_id
ORDER BY employee_name
;'''

pd.read_sql_query(q, conn)

      employee_name       employee_title   supervisor_name supervisor_title
0      Andrew Adams      General Manager              None             None
1      Jane Peacock  Sales Support Agent     Nancy Edwards    Sales Manager
2    Laura Callahan             IT Staff  Michael Mitchell       IT Manager
3     Margaret Park  Sales Support Agent     Nancy Edwards    Sales Manager
4  Michael Mitchell           IT Manager      Andrew Adams  General Manager
5     Nancy Edwards        Sales Manager      Andrew Adams  General Manager
6       Robert King             IT Staff  Michael Mitchell       IT Manager
7     Steve Johnson  Sales Support Agent     Nancy Edwards    Sales Manager

Using % and LIKE for pattern matching

In [5]:
q = '''
SELECT first_name, last_name, phone
FROM customer
WHERE first_name LIKE "%Belle%"
;'''

pd.read_sql_query(q, conn)

  first_name last_name               phone
0   Isabelle   Mercier  +33 03 80 73 66 99

CASE Aliases

In [6]:
q = '''
SELECT 
c.first_name || " " || c.last_name customer_name,
i.purchases number_of_purchases,
i.total_spent,
CASE
    WHEN total_spent < 40 THEN "small spender"
    WHEN total_spent > 100 THEN "big spender"
    ELSE "regular"
END
    AS customer_category
FROM customer c INNER JOIN (SELECT SUM(total) as total_spent, COUNT(*) as purchases, customer_id
                            FROM invoice
                            GROUP BY customer_id
                            ) as i
                ON c.customer_id = i.customer_id
ORDER BY customer_name
;'''

pd.read_sql_query(q, conn)

            customer_name  number_of_purchases  total_spent customer_category
0          Aaron Mitchell                    8        70.29           regular
1         Alexandre Rocha                   10        69.30           regular
2           Astrid Gruber                    9        69.30           regular
3            Bjørn Hansen                    9        72.27           regular
4         Camille Bernard                    9        79.20           regular
5            Daan Peeters                    7        60.39           regular
6              Dan Miller                   12        95.04           regular
7         Diego Gutiérrez                    5        39.60     small spender
8      Dominique Lefebvre                    9        72.27           regular
9         Eduardo Martins                   12        60.39           regular
10         Edward Francis                   13        91.08           regular
11         Ellie Sullivan                   12        75.24           regular
12             Emma Jones                    8        68.31           regular
13          Enrique Muñoz                   11        98.01           regular
14         Fernanda Ramos                   15       106.92       big spender
15           Frank Harris                    8        74.25           regular
16          Frank Ralston                    8        71.28           regular
17  František Wichterlová                   18       144.54       big spender
18      François Tremblay                    9        99.99           regular
19        Fynn Zimmermann                   10        94.05           regular
20       Hannah Schneider                   11        85.14           regular
21        Heather Leacock                   12        92.07           regular
22            Helena Holý                   12       128.70       big spender
23          Hugh O'Reilly                   13       114.84       big spender
24       Isabelle Mercier                   12        73.26           regular
25             Jack Smith                   12        98.01           regular
26      Jennifer Peterson                    9        66.33           regular
27       Joakim Johansson                   10        75.24           regular
28  Johannes Van der Berg                   10        65.34           regular
29            John Gordon                   10        66.33           regular
30         João Fernandes                   13       102.96       big spender
31          Julia Barnett                   10        72.27           regular
32           Kara Nielsen                   10        37.62     small spender
33            Kathy Chase                   11        91.08           regular
34        Ladislav Kovács                   10        78.21           regular
35          Leonie Köhler                   11        82.17           regular
36          Lucas Mancini                    9        50.49           regular
37             Luis Rojas                   13        97.02           regular
38         Luís Gonçalves                   13       108.90       big spender
39       Madalena Sampaio                   16        82.17           regular
40           Manoj Pareek                   13       111.87       big spender
41            Marc Dubois                    9        64.35           regular
42           Mark Philips                   10        29.70     small spender
43            Mark Taylor                   10        81.18           regular
44            Martha Silk                   11        62.37           regular
45        Michelle Brooks                    8        79.20           regular
46        Niklas Schröder                    9        73.26           regular
47           Patrick Gray                    9        84.15           regular
48            Phil Hughes                   11        98.01           regular
49        Puja Srivastava                    8        71.28           regular
50     Richard Cunningham                   12        86.13           regular
51           Robert Brown                    4        40.59           regular
52        Roberto Almeida                   11        82.17           regular
53       Stanisław Wójcik                   10        76.23           regular
54           Steve Murray                    9        79.20           regular
55       Terhi Hämäläinen                   11        79.20           regular
56              Tim Goyer                    9        54.45           regular
57         Victor Stevens                   10        76.23           regular
58           Wyatt Girard                   11        99.99           regular

## Begin Working on Style and Readability for SQL Queries

Naming subqueries with WITH and making sure that Spacing services readability in code style

In [7]:
q = '''
WITH playlist_info AS
    (
    SELECT p.playlist_id, p.name playlist_name, t.name track_name, (t.milliseconds / 1000) seconds
    FROM playlist p 
    LEFT JOIN playlist_track pt ON p.playlist_id = pt.playlist_id
    LEFT JOIN track t ON pt.track_id = t.track_id
    )
SELECT playlist_id, playlist_name, COUNT(track_name) number_of_tracks, SUM(seconds) length_seconds
FROM playlist_info
GROUP BY playlist_id, playlist_name
ORDER BY playlist_id
;'''

pd.read_sql_query(q, conn)

    playlist_id               playlist_name  number_of_tracks  length_seconds
0             1                       Music              3290        876049.0
1             2                      Movies                 0             NaN
2             3                    TV Shows               213        500987.0
3             4                  Audiobooks                 0             NaN
4             5                  90’s Music              1477        397970.0
5             6                  Audiobooks                 0             NaN
6             7                      Movies                 0             NaN
7             8                       Music              3290        876049.0
8             9                Music Videos                 1           294.0
9            10                    TV Shows               213        500987.0
10           11             Brazilian Music                39          9464.0
11           12                   Classical                75         21736.0
12           13   Classical 101 - Deep Cuts                25          6742.0
13           14  Classical 101 - Next Steps                25          7565.0
14           15  Classical 101 - The Basics                25          7429.0
15           16                      Grunge                15          4114.0
16           17         Heavy Metal Classic                26          8189.0
17           18                 On-The-Go 1                 1           197.0

In [8]:
q = '''
SELECT p.playlist_id, p.name playlist_name, t.name track_name, (t.milliseconds / 1000) seconds
    FROM playlist p 
    LEFT JOIN playlist_track pt ON p.playlist_id = pt.playlist_id
    INNER JOIN track t ON pt.track_id = t.track_id
;'''

pd.read_sql_query(q, conn)

,playlist_id,playlist_name,track_name,seconds
0,1,Music,For Those About To Rock (We Salute You),343
1,1,Music,Balls to the Wall,342
2,1,Music,Fast As a Shark,230
3,1,Music,Restless and Wild,252
4,1,Music,Princess of the Dawn,375
5,1,Music,Put The Finger On You,205
6,1,Music,Let's Get It Up,233
7,1,Music,Inject The Venom,210
8,1,Music,Snowballed,203
9,1,Music,Evil Walks,263
10,1,Music,C.O.D.,199
11,1,Music,Breaking The Rules,263
12,1,Music,Night Of The Long Knives,205
13,1,Music,Spellbound,270
14,1,Music,Go Down,331
15,1,Music,Dog Eat Dog,215
16,1,Music,Let There Be Rock,366
17,1,Music,Bad Boy Boogie,267
18,1,Music,Problem Child,325
19,1,Music,Overdose,369
20,1,Music,Hell Ain't A Bad Place To Be,254
21,1,Music,Whole Lotta Rosie,323
22,1,Music,Walk On Water,295
23,1,Music,Love In An Elevator,321
24,1,Music,Rag Doll,264
25,1,Music,What It Takes,310
26,1,Music,Dude (Looks Like A Lady),264
27,1,Music,Janie's Got A Gun,330
28,1,Music,Cryin',309
29,1,Music,Amazing,356
...,...,...,...,...
8685,16,Grunge,Black Hole Sun,320
8686,16,Grunge,Plush,314
8687,16,Grunge,Hunger Strike,246
8688,17,Heavy Metal Classic,For Those About To Rock (We Salute You),343
8689,17,Heavy Metal Classic,Balls to the Wall,342
8690,17,Heavy Metal Classic,Fast As a Shark,230
8691,17,Heavy Metal Classic,Restless and Wild,252
8692,17,Heavy Metal Classic,Princess of the Dawn,375
8693,17,Heavy Metal Classic,N.I.B.,368
8694,17,Heavy Metal Classic,Supernaut,285
8695,17,Heavy Metal Classic,Wrathchild,174
8696,17,Heavy Metal Classic,Killers,300
8697,17,Heavy Metal Classic,Where Eagles Dare,369
8698,17,Heavy Metal Classic,2 Minutes To Midnight,359
8699,17,Heavy Metal Classic,Wasted Years,307
8700,17,Heavy Metal Classic,Run to the Hills,228
8701,17,Heavy Metal Classic,Enter Sandman,332
8702,17,Heavy Metal Classic,The Four Horsemen,433
8703,17,Heavy Metal Classic,Seek & Destroy,415
8704,17,Heavy Metal Classic,Master Of Puppets,515
8705,17,Heavy Metal Classic,For Whom The Bell Tolls,311
8706,17,Heavy Metal Classic,Creeping Death,396
8707,17,Heavy Metal Classic,Ace Of Spades,169
8708,17,Heavy Metal Classic,Live To Win,217
8709,17,Heavy Metal Classic,Looks That Kill,240
8710,17,Heavy Metal Classic,I Don't Know,312
8711,17,Heavy Metal Classic,Crazy Train,295
8712,17,Heavy Metal Classic,Flying High Again,290
8713,17,Heavy Metal Classic,The Zoo,332
8714,18,On-The-Go 1,Now's The Time,197

### Creating and using VIEWs

In [9]:
cursor.execute('DROP VIEW customer_gt_90_dollars')
cursor.execute('DROP VIEW customer_usa')

In [10]:
q = '''
CREATE VIEW customer_usa AS 
     SELECT * FROM customer
     WHERE country = "USA"
;'''
cursor.execute(q)

Make a View that contains all customer data for customers with more than $90 spent

In [11]:
q1 = '''
CREATE VIEW customer_gt_90_dollars AS
    SELECT c.*
    FROM customer c
    INNER JOIN invoice i ON c.customer_id = i.customer_id
    GROUP BY c.customer_id
    HAVING SUM(i.total) > 90;
'''

q2 = '''SELECT *
FROM customer_gt_90_dollars
;'''

cursor.execute(q1)
pd.read_sql_query(q2, conn)

,customer_id,first_name,last_name,company,address,city,state,country,postal_code,phone,fax,email,support_rep_id
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3
2,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,None,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4
3,6,Helena,Holý,None,Rilská 3174/6,Prague,None,Czech Republic,14300,+420 2 4177 0449,None,hholy@gmail.com,5
4,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4
5,17,Jack,Smith,Microsoft Corporation,1 Microsoft Way,Redmond,WA,USA,98052-8300,+1 (425) 882-8080,+1 (425) 882-8081,jacksmith@microsoft.com,5
6,20,Dan,Miller,None,541 Del Medio Avenue,Mountain View,CA,USA,94040-111,+1 (650) 644-3358,None,dmiller@comcast.com,4
7,21,Kathy,Chase,None,801 W 4th Street,Reno,NV,USA,89503,+1 (775) 223-7665,None,kachase@hotmail.com,5
8,22,Heather,Leacock,None,120 S Orange Ave,Orlando,FL,USA,32801,+1 (407) 999-7788,None,hleacock@gmail.com,4
9,30,Edward,Francis,None,230 Elgin Street,Ottawa,ON,Canada,K2P 1L7,+1 (613) 234-3322,None,edfrancis@yachoo.ca,3
10,34,João,Fernandes,None,Rua da Assunção 53,Lisbon,None,Portugal,None,+351 (213) 466-111,None,jfernandes@yahoo.pt,4
11,37,Fynn,Zimmermann,None,Berger Straße 10,Frankfurt,None,Germany,60316,+49 069 40598889,None,fzimmermann@yahoo.de,3
12,42,Wyatt,Girard,None,"9, Place Louis Barthou",Bordeaux,None,France,33000,+33 05 56 96 96 96,None,wyatt.girard@yahoo.fr,3
13,46,Hugh,O'Reilly,None,3 Chatham Street,Dublin,Dublin,Ireland,None,+353 01 6792424,None,hughoreilly@apple.ie,3
14,50,Enrique,Muñoz,None,C/ San Bernardo 85,Madrid,None,Spain,28015,+34 914 454 454,None,enrique_munoz@yahoo.es,5
15,53,Phil,Hughes,None,113 Lupus St,London,None,United Kingdom,SW1V 3EN,+44 020 7976 5722,None,phil.hughes@gmail.com,3
16,57,Luis,Rojas,None,"Calle Lira, 198",Santiago,None,Chile,None,+56 (0)2 635 4444,None,luisrojas@yahoo.cl,5
17,58,Manoj,Pareek,None,"12,Community Centre",Delhi,None,India,110017,+91 0124 39883988,None,manoj.pareek@rediff.com,3

Query All Customers who are in the US or who spent more than $90

In [12]:
q = '''
SELECT *
FROM customer_usa

UNION

SELECT *
FROM customer_gt_90_dollars
;'''

pd.read_sql_query(q, conn)

,customer_id,first_name,last_name,company,address,city,state,country,postal_code,phone,fax,email,support_rep_id
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3
2,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,None,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4
3,6,Helena,Holý,None,Rilská 3174/6,Prague,None,Czech Republic,14300,+420 2 4177 0449,None,hholy@gmail.com,5
4,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4
5,16,Frank,Harris,Google Inc.,1600 Amphitheatre Parkway,Mountain View,CA,USA,94043-1351,+1 (650) 253-0000,+1 (650) 253-0000,fharris@google.com,4
6,17,Jack,Smith,Microsoft Corporation,1 Microsoft Way,Redmond,WA,USA,98052-8300,+1 (425) 882-8080,+1 (425) 882-8081,jacksmith@microsoft.com,5
7,18,Michelle,Brooks,None,627 Broadway,New York,NY,USA,10012-2612,+1 (212) 221-3546,+1 (212) 221-4679,michelleb@aol.com,3
8,19,Tim,Goyer,Apple Inc.,1 Infinite Loop,Cupertino,CA,USA,95014,+1 (408) 996-1010,+1 (408) 996-1011,tgoyer@apple.com,3
9,20,Dan,Miller,None,541 Del Medio Avenue,Mountain View,CA,USA,94040-111,+1 (650) 644-3358,None,dmiller@comcast.com,4
10,21,Kathy,Chase,None,801 W 4th Street,Reno,NV,USA,89503,+1 (775) 223-7665,None,kachase@hotmail.com,5
11,22,Heather,Leacock,None,120 S Orange Ave,Orlando,FL,USA,32801,+1 (407) 999-7788,None,hleacock@gmail.com,4
12,23,John,Gordon,None,69 Salem Street,Boston,MA,USA,2113,+1 (617) 522-1333,None,johngordon22@yahoo.com,4
13,24,Frank,Ralston,None,162 E Superior Street,Chicago,IL,USA,60611,+1 (312) 332-3232,None,fralston@gmail.com,3
14,25,Victor,Stevens,None,319 N. Frances Street,Madison,WI,USA,53703,+1 (608) 257-0597,None,vstevens@yahoo.com,5
15,26,Richard,Cunningham,None,2211 W Berry Street,Fort Worth,TX,USA,76110,+1 (817) 924-7272,None,ricunningham@hotmail.com,4
16,27,Patrick,Gray,None,1033 N Park Ave,Tucson,AZ,USA,85719,+1 (520) 622-4200,None,patrick.gray@aol.com,4
17,28,Julia,Barnett,None,302 S 700 E,Salt Lake City,UT,USA,84102,+1 (801) 531-7272,None,jubarnett@gmail.com,5
18,30,Edward,Francis,None,230 Elgin Street,Ottawa,ON,Canada,K2P 1L7,+1 (613) 234-3322,None,edfrancis@yachoo.ca,3
19,34,João,Fernandes,None,Rua da Assunção 53,Lisbon,None,Portugal,None,+351 (213) 466-111,None,jfernandes@yahoo.pt,4
20,37,Fynn,Zimmermann,None,Berger Straße 10,Frankfurt,None,Germany,60316,+49 069 40598889,None,fzimmermann@yahoo.de,3
21,42,Wyatt,Girard,None,"9, Place Louis Barthou",Bordeaux,None,France,33000,+33 05 56 96 96 96,None,wyatt.girard@yahoo.fr,3
22,46,Hugh,O'Reilly,None,3 Chatham Street,Dublin,Dublin,Ireland,None,+353 01 6792424,None,hughoreilly@apple.ie,3
23,50,Enrique,Muñoz,None,C/ San Bernardo 85,Madrid,None,Spain,28015,+34 914 454 454,None,enrique_munoz@yahoo.es,5
24,53,Phil,Hughes,None,113 Lupus St,London,None,United Kingdom,SW1V 3EN,+44 020 7976 5722,None,phil.hughes@gmail.com,3
25,57,Luis,Rojas,None,"Calle Lira, 198",Santiago,None,Chile,None,+56 (0)2 635 4444,None,luisrojas@yahoo.cl,5
26,58,Manoj,Pareek,None,"12,Community Centre",Delhi,None,India,110017,+91 0124 39883988,None,manoj.pareek@rediff.com,3

Query the number of customers with large purchases in the us who went to each sales rep.

***Wanted to include sales reps that had 0 such customers as well***

In [13]:
q = '''
WITH customers_usa_gt_90 AS
    (SELECT *
     FROM customer_gt_90_dollars
     
     INTERSECT
     
     SELECT *
     FROM customer_usa)
     
SELECT 
    e.first_name ||' ' || e.last_name employee_name,
    COUNT(c.customer_id) customers_usa_gt_90_dollars
FROM
    employee e
    LEFT JOIN
    customers_usa_gt_90 as c
    ON c.support_rep_id = e.employee_id
GROUP BY e.employee_id HAVING e.title = 'Sales Support Agent'
;'''

pd.read_sql_query(q, conn)

   employee_name  customers_usa_gt_90_dollars
0   Jane Peacock                            0
1  Margaret Park                            2
2  Steve Johnson                            2

Just checking out the **employee** table

In [14]:
pd.read_sql_query('SELECT * FROM employee', conn)

,employee_id,last_name,first_name,title,reports_to,birthdate,hire_date,address,city,state,country,postal_code,phone,fax,email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2016-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2016-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2017-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2017-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2017-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com
5,6,Mitchell,Michael,IT Manager,1.0,1973-07-01 00:00:00,2016-10-17 00:00:00,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com
6,7,King,Robert,IT Staff,6.0,1970-05-29 00:00:00,2017-01-02 00:00:00,590 Columbia Boulevard West,Lethbridge,AB,Canada,T1K 5N8,+1 (403) 456-9986,+1 (403) 456-8485,robert@chinookcorp.com
7,8,Callahan,Laura,IT Staff,6.0,1968-01-09 00:00:00,2017-03-04 00:00:00,923 7 ST NW,Lethbridge,AB,Canada,T1H 1Y8,+1 (403) 467-3351,+1 (403) 467-8772,laura@chinookcorp.com

Query customer name and total from india. <br>
Use two subqueries. <br>

*Mistake that I made was to join invoice to customer ID for customer_total. No Join was necessary*

In [15]:
q = '''
WITH 
    customers_india AS
        (
         SELECT *
         FROM customer
         WHERE country = 'India'
        ),
    customer_total AS
        (
         SELECT customer_id, SUM(total) total
         FROM invoice
         GROUP BY customer_id
        )


        
SELECT 
    ci.first_name || ' ' || ci.last_name customer_name,
    ct.total total_purchases
FROM 
    customers_india ci
INNER JOIN customer_total ct ON ci.customer_id = ct.customer_id
ORDER BY customer_name
;'''

pd.read_sql_query(q, conn)

     customer_name  total_purchases
0     Manoj Pareek           111.87
1  Puja Srivastava            71.28

Find the best customer from each country

In [36]:
q = '''
WITH
    customer_country_purchases AS
        (
         SELECT
             i.customer_id,
             c.country,
             SUM(i.total) total_purchases
         FROM invoice i
         INNER JOIN customer c ON i.customer_id = c.customer_id
         GROUP BY i.customer_id, c.country
        ),
    country_max_purchase AS
        (
         SELECT
             country,
             MAX(total_purchases) max_purchase
         FROM customer_country_purchases
         GROUP BY country
        ),
    country_best_customer AS
        (
         SELECT
            cmp.country,
            cmp.max_purchase,
            (
             SELECT ccp.customer_id
             FROM customer_country_purchases ccp
             WHERE ccp.country = cmp.country AND cmp.max_purchase = ccp.total_purchases
            ) customer_id
         FROM country_max_purchase cmp
        )
SELECT
    cbc.country country,
    c.first_name || " " || c.last_name customer_name,
    cbc.max_purchase total_purchased
FROM customer c
INNER JOIN country_best_customer cbc ON cbc.customer_id = c.customer_id
ORDER BY country ASC
;'''

pd.read_sql_query(q, conn)

           country          customer_name  total_purchased
0        Argentina        Diego Gutiérrez            39.60
1        Australia            Mark Taylor            81.18
2          Austria          Astrid Gruber            69.30
3          Belgium           Daan Peeters            60.39
4           Brazil         Luís Gonçalves           108.90
5           Canada      François Tremblay            99.99
6            Chile             Luis Rojas            97.02
7   Czech Republic  František Wichterlová           144.54
8          Denmark           Kara Nielsen            37.62
9          Finland       Terhi Hämäläinen            79.20
10          France           Wyatt Girard            99.99
11         Germany        Fynn Zimmermann            94.05
12         Hungary        Ladislav Kovács            78.21
13           India           Manoj Pareek           111.87
14         Ireland          Hugh O'Reilly           114.84
15           Italy          Lucas Mancini            50.49
16     Netherlands  Johannes Van der Berg            65.34
17          Norway           Bjørn Hansen            72.27
18          Poland       Stanisław Wójcik            76.23
19        Portugal         João Fernandes           102.96
20           Spain          Enrique Muñoz            98.01
21          Sweden       Joakim Johansson            75.24
22             USA             Jack Smith            98.01
23  United Kingdom            Phil Hughes            98.01